10/data/attachments/7549fd36fbb32a91.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_e60064b1-13fa-444d-95f4-8724cdd29528</nif:username>
            <nif:friendToBeAdded>John_traditional_Actions_23832_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>